zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/i3c_reg.h
/**************************************************************************//**
 * @file     i3c_reg.h
 * @version  V1.00
 * @brief    I3C register definition header file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#ifndef __I3C_REG_H__
#define __I3C_REG_H__

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif

/**
    @addtogroup REGISTER Control Register
    @{
*/

/**
    @addtogroup I3C I3C Serial Interface Controller (I3C)
    Memory Mapped Structure for I3C Controller
    @{
*/

typedef struct
{
    __IO uint32_t DEVCTL;               /*!< [0x0000] I3C Device Control Register */
    __IO uint32_t DEVADDR;              /*!< [0x0004] I3C Device Address Register */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE0;
    /// @endcond //HIDDEN_SYMBOLS
    __O  uint32_t CMDQUE;               /*!< [0x000c] I3C Command Queue Port Register */
    __I  uint32_t RESPQUE;              /*!< [0x0010] I3C Response Queue Port Register */
    __IO uint32_t TXRXDAT;              /*!< [0x0014] I3C Transmit and Receive Data Port Register */
    union
    {
        __IO uint32_t IBIQUE;           /*!< [0x0018] I3C In-Band Interrupt Queue Data Register */
        __IO uint32_t IBISTS;           /*!< [0x0018] I3C In-Band Interrupt Queue Status Register */
    };
    __IO uint32_t QUETHCTL;             /*!< [0x001c] I3C Queue Threshold Control Register */
    __IO uint32_t DBTHCTL;              /*!< [0x0020] I3C Data Buffer Threshold Control Register */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE1[4];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t RSTCTL;               /*!< [0x0034] I3C Reset Control Register */
    __IO uint32_t SLVEVNTS;             /*!< [0x0038] I3C Slave Event Status Register */
    __IO uint32_t INTSTS;               /*!< [0x003c] I3C Interrupt Status Register */
    __IO uint32_t INTSTSEN;             /*!< [0x0040] I3C Interrupt Status Enable Register */
    __IO uint32_t INTEN;                /*!< [0x0044] I3C Interrupt Signal Enable Register */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE2;
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t QUESTSLV;             /*!< [0x004c] I3C Queue Status Level Register */
    __I  uint32_t DBSTSLV;              /*!< [0x0050] I3C Data Buffer Status Level Register */
    __I  uint32_t PRESENTS;             /*!< [0x0054] I3C Present State Register */
    __I  uint32_t CCCDEVS;              /*!< [0x0058] I3C Device Operating Status Register */
    __I  uint32_t ADDRTP;               /*!< [0x005c] I3C Pointer for Device Address Table Register */
    __I  uint32_t CHRTP;                /*!< [0x0060] I3C Pointer for Device Characteristics Table Register */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE3[2];
    /// @endcond //HIDDEN_SYMBOLS
    __I  uint32_t VENDOR;               /*!< [0x006c] I3C Pointer for Vendor specific Register */
    __IO uint32_t SLVMID;               /*!< [0x0070] I3C MIPI Manufacturer ID Register */
    __IO uint32_t SLVPID;               /*!< [0x0074] I3C Normal Provisional ID Register */
    __IO uint32_t SLVCHAR;              /*!< [0x0078] I3C Slave Characteristic Register */
    __I  uint32_t SLVMXLEN;             /*!< [0x007c] I3C Maximum Write/Read Length Register */
    __I  uint32_t MXRDTURN;             /*!< [0x0080] I3C Maximum Read Turnaround Time Register */
    __IO uint32_t MXDS;                 /*!< [0x0084] I3C Maximum Data Speed Register */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE4;
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t SIR;                  /*!< [0x008c] I3C Slave Interrupt Request Register */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE5;
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t SIRDAT;               /*!< [0x0094] I3C Slave Interrupt Request Data Register */
    __IO uint32_t SIRRESP;              /*!< [0x0098] I3C Slave Interrupt Request Response Register */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE6[5];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t DEVCTLE;              /*!< [0x00b0] I3C Device Control Extended Register */
    __IO uint32_t SCLOD;                /*!< [0x00b4] SCL I3C Open Drain Timing Register */
    __IO uint32_t SCLPP;                /*!< [0x00b8] SCL I3C Push Pull Timing Register */
    __IO uint32_t SCLFM;                /*!< [0x00bc] SCL I2C Fast Mode Timing Register */
    __IO uint32_t SCLFMP;               /*!< [0x00c0] SCL I2C Fast Mode Plus Timing Register */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE7;
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t SCLEXTL;              /*!< [0x00c8] I3C SCL Extended Low Count Timing Register */
    __IO uint32_t SCLTERM;              /*!< [0x00cc] I3C SCL Termination Bit Low count Timing Register */
    __IO uint32_t SDAHOLD;              /*!< [0x00d0] SDA Hold and Mode Switch Delay Timing Register */
    __IO uint32_t BUSFAT;               /*!< [0x00d4] I3C Bus Free And Available Timing Register */
    __IO uint32_t BUSIDLET;             /*!< [0x00d8] I3C Bus Idle Timing Register */
    __I  uint32_t SCLLOW;               /*!< [0x00dc] SCL Low Timeout Register */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE8[72];
    /// @endcond //HIDDEN_SYMBOLS
    __I  uint32_t DEV1CH[4];            /*!< [0x0200 ~ 0x020c] Device Characteristic Table Location of Device1 Register */
    __I  uint32_t DEV2CH[4];            /*!< [0x0210 ~ 0x021c] Device Characteristic Table Location of Device2 Register */
    __I  uint32_t DEV3CH[4];            /*!< [0x0220 ~ 0x022c] Device Characteristic Table Location of Device3 Register */
    __I  uint32_t DEV4CH[4];            /*!< [0x0230 ~ 0x023c] Device Characteristic Table Location of Device4 Register */
    __I  uint32_t DEV5CH[4];            /*!< [0x0240 ~ 0x024c] Device Characteristic Table Location of Device5 Register */
    __I  uint32_t DEV6CH[4];            /*!< [0x0250 ~ 0x025c] Device Characteristic Table Location of Device6 Register */
    __I  uint32_t DEV7CH[4];            /*!< [0x0260 ~ 0x026c] Device Characteristic Table Location of Device7 Register */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE9[4];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t DEV1ADR;              /*!< [0x0280] Device Address Table Location of Device1 Register */
    __IO uint32_t DEV2ADR;              /*!< [0x0284] Device Address Table Location of Device2 Register */
    __IO uint32_t DEV3ADR;              /*!< [0x0288] Device Address Table Location of Device3 Register */
    __IO uint32_t DEV4ADR;              /*!< [0x028c] Device Address Table Location of Device4 Register */
    __IO uint32_t DEV5ADR;              /*!< [0x0290] Device Address Table Location of Device5 Register */
    __IO uint32_t DEV6ADR;              /*!< [0x0294] Device Address Table Location of Device6 Register */
    __IO uint32_t DEV7ADR;              /*!< [0x0298] Device Address Table Location of Device7 Register */
} I3C_T;

/**
    @addtogroup I3C_CONST I3C Bit Field Definition
    Constant Definitions for I3C Controller
    @{
*/

#define I3C_DEVCTL_IBAINCL_Pos          (0U)
#define I3C_DEVCTL_IBAINCL_Msk          (1UL << I3C_DEVCTL_IBAINCL_Pos)

#define I3C_DEVCTL_PENDINT_Pos          (3U)
#define I3C_DEVCTL_PENDINT_Msk          (0xFUL << I3C_DEVCTL_PENDINT_Pos)

#define I3C_DEVCTL_HJCTL_Pos            (8U)
#define I3C_DEVCTL_HJCTL_Msk            (1UL << I3C_DEVCTL_HJCTL_Pos)

#define I3C_DEVCTL_IDLECNT_Pos          (24U)
#define I3C_DEVCTL_IDLECNT_Msk          (0x3UL << I3C_DEVCTL_IDLECNT_Pos)

#define I3C_DEVCTL_ADAPTIVE_Pos         (27U)
#define I3C_DEVCTL_ADAPTIVE_Msk         (1UL << I3C_DEVCTL_ADAPTIVE_Pos)

