zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/i3c_reg.h
#define I3C_DEVCTL_DMAEN_Pos            (28U)
#define I3C_DEVCTL_DMAEN_Msk            (1UL << I3C_DEVCTL_DMAEN_Pos)

#define I3C_DEVCTL_ABORT_Pos            (29U)
#define I3C_DEVCTL_ABORT_Msk            (1UL << I3C_DEVCTL_ABORT_Pos)

#define I3C_DEVCTL_RESUME_Pos           (30U)
#define I3C_DEVCTL_RESUME_Msk           (1UL << I3C_DEVCTL_RESUME_Pos)

#define I3C_DEVCTL_ENABLE_Pos           (31U)
#define I3C_DEVCTL_ENABLE_Msk           (1UL << I3C_DEVCTL_ENABLE_Pos)

#define I3C_DEVADDR_SA_Pos              (0U)
#define I3C_DEVADDR_SA_Msk              (0x7FUL << I3C_DEVADDR_SA_Pos)

#define I3C_DEVADDR_SAVALID_Pos         (15U)
#define I3C_DEVADDR_SAVALID_Msk         (1UL << I3C_DEVADDR_SAVALID_Pos)

#define I3C_DEVADDR_DA_Pos              (16U)
#define I3C_DEVADDR_DA_Msk              (0x7FUL << I3C_DEVADDR_DA_Pos)

#define I3C_DEVADDR_DAVALID_Pos         (31U)
#define I3C_DEVADDR_DAVALID_Msk         (1UL << I3C_DEVADDR_DAVALID_Pos)

#define I3C_CMDQUE_ATTR_Pos             (0U)
#define I3C_CMDQUE_ATTR_Msk             (0x7UL << I3C_CMDQUE_ATTR_Pos)

#define I3C_CMDQUE_TID_Pos              (3U)
#define I3C_CMDQUE_TID_Msk              (0xFUL << I3C_CMDQUE_TID_Pos)

#define I3C_CMDQUE_CMD_Pos              (7U)
#define I3C_CMDQUE_CMD_Msk              (0xFFUL << I3C_CMDQUE_CMD_Pos)

#define I3C_CMDQUE_CP_Pos               (15U)
#define I3C_CMDQUE_CP_Msk               (1UL << I3C_CMDQUE_CP_Pos)

#define I3C_CMDQUE_DEVINDX_Pos          (16U)
#define I3C_CMDQUE_DEVINDX_Msk          (0x1FUL << I3C_CMDQUE_DEVINDX_Pos)

#define I3C_CMDQUE_SPEED_Pos            (21U)
#define I3C_CMDQUE_SPEED_Msk            (0x7UL << I3C_CMDQUE_SPEED_Pos)

#define I3C_CMDQUE_DBP_Pos              (25U)
#define I3C_CMDQUE_DBP_Msk              (0x1UL << I3C_CMDQUE_DBP_Pos)

#define I3C_CMDQUE_ROC_Pos              (26U)
#define I3C_CMDQUE_ROC_Msk              (0x1UL << I3C_CMDQUE_ROC_Pos)

#define I3C_CMDQUE_SDAP_Pos             (27U)
#define I3C_CMDQUE_SDAP_Msk             (0x1UL << I3C_CMDQUE_SDAP_Pos)

#define I3C_CMDQUE_RNW_Pos              (28U)
#define I3C_CMDQUE_RNW_Msk              (0x1UL << I3C_CMDQUE_RNW_Pos)

#define I3C_CMDQUE_TOC_Pos              (30U)
#define I3C_CMDQUE_TOC_Msk              (0x1UL << I3C_CMDQUE_TOC_Pos)

#define I3C_CMDQUE_PEC_Pos              (31U)
#define I3C_CMDQUE_PEC_Msk              (0x1UL << I3C_CMDQUE_PEC_Pos)

#define I3C_CMDQUE_DB_Pos               (8U)
#define I3C_CMDQUE_DB_Msk               (0xFFUL << I3C_CMDQUE_DB_Pos)

#define I3C_CMDQUE_DATLEN_Pos           (16U)
#define I3C_CMDQUE_DATLEN_Msk           (0xFFFFUL << I3C_CMDQUE_DATLEN_Pos)

#define I3C_CMDQUE_BYTESTRB_Pos         (3U)
#define I3C_CMDQUE_BYTESTRB_Msk         (0x7UL << I3C_CMDQUE_BYTESTRB_Pos)

#define I3C_CMDQUE_DATBYTE0_Pos         (8U)
#define I3C_CMDQUE_DATBYTE0_Msk         (0xFFUL << I3C_CMDQUE_DATBYTE0_Pos)

#define I3C_CMDQUE_DATBYTE1_Pos         (16U)
#define I3C_CMDQUE_DATBYTE1_Msk         (0xFFUL << I3C_CMDQUE_DATBYTE1_Pos)

#define I3C_CMDQUE_DATBYTE2_Pos         (24U)
#define I3C_CMDQUE_DATBYTE2_Msk         (0xFFUL << I3C_CMDQUE_DATBYTE2_Pos)

#define I3C_CMDQUE_DEVCOUNT_Pos         (21U)
#define I3C_CMDQUE_DEVCOUNT_Msk         (0x1FUL << I3C_CMDQUE_DEVCOUNT_Pos)

#define I3C_RESPQUE_DATLEN_Pos          (0U)
#define I3C_RESPQUE_DATLEN_Msk          (0xFFFFUL << I3C_RESPQUE_DATLEN_Pos)

#define I3C_RESPQUE_HDRCODE_Pos         (16U)
#define I3C_RESPQUE_HDRCODE_Msk         (0xFFUL << I3C_RESPQUE_HDRCODE_Pos)

#define I3C_RESPQUE_TID_Pos             (24U)
#define I3C_RESPQUE_TID_Msk             (0xFUL << I3C_RESPQUE_TID_Pos)

#define I3C_RESPQUE_RXRESP_Pos          (27U)
#define I3C_RESPQUE_RXRESP_Msk          (1UL << I3C_RESPQUE_RXRESP_Pos)

#define I3C_RESPQUE_ERRSTS_Pos          (28U)
#define I3C_RESPQUE_ERRSTS_Msk          (0xFUL << I3C_RESPQUE_ERRSTS_Pos)

#define I3C_TXRXDAT_DAT_Pos             (0U)
#define I3C_TXRXDAT_DAT_Msk             (0xFFFFFFFFUL << I3C_TXRXDAT_DAT_Pos)

#define I3C_IBIQUE_DAT_Pos              (0U)
#define I3C_IBIQUE_DAT_Msk              (0xFFFFFFFFUL << I3C_IBIQUE_DAT_Pos)

#define I3C_IBISTS_DATLEN_Pos           (0U)
#define I3C_IBISTS_DATLEN_Msk           (0xFFUL << I3C_IBISTS_DATLEN_Pos)

#define I3C_IBISTS_IBIID_Pos            (8U)
#define I3C_IBISTS_IBIID_Msk            (0xFFUL << I3C_IBISTS_IBIID_Pos)

#define I3C_IBISTS_IBISTS_Pos           (24U)
#define I3C_IBISTS_IBISTS_Msk           (0xFFUL << I3C_IBISTS_IBISTS_Pos)

#define I3C_QUETHCTL_CMDETH_Pos         (0U)
#define I3C_QUETHCTL_CMDETH_Msk         (0xFFUL << I3C_QUETHCTL_CMDETH_Pos)

#define I3C_QUETHCTL_RESPTH_Pos         (8U)
#define I3C_QUETHCTL_RESPTH_Msk         (0xFFUL << I3C_QUETHCTL_RESPTH_Pos)

#define I3C_QUETHCTL_IBIDATTH_Pos       (16U)
#define I3C_QUETHCTL_IBIDATTH_Msk       (0xFFUL << I3C_QUETHCTL_IBIDATTH_Pos)

#define I3C_QUETHCTL_IBISTSTH_Pos       (24U)
#define I3C_QUETHCTL_IBISTSTH_Msk       (0xFFUL << I3C_QUETHCTL_IBISTSTH_Pos)

#define I3C_DBTHCTL_TXTH_Pos            (0U)
#define I3C_DBTHCTL_TXTH_Msk            (0x7UL << I3C_DBTHCTL_TXTH_Pos)

#define I3C_DBTHCTL_RXTH_Pos            (8U)
#define I3C_DBTHCTL_RXTH_Msk            (0x7UL << I3C_DBTHCTL_RXTH_Pos)

#define I3C_DBTHCTL_TXSTATH_Pos         (16U)
#define I3C_DBTHCTL_TXSTATH_Msk         (0x7UL << I3C_DBTHCTL_TXSTATH_Pos)

#define I3C_DBTHCTL_RXSTATH_Pos         (24U)
#define I3C_DBTHCTL_RXSTATH_Msk         (0x7UL << I3C_DBTHCTL_RXSTATH_Pos)

#define I3C_RSTCTL_SWRST_Pos            (0U)
#define I3C_RSTCTL_SWRST_Msk            (1UL << I3C_RSTCTL_SWRST_Pos)

#define I3C_RSTCTL_CMDRST_Pos           (1U)
#define I3C_RSTCTL_CMDRST_Msk           (1UL << I3C_RSTCTL_CMDRST_Pos)

#define I3C_RSTCTL_RESPRST_Pos          (2U)
#define I3C_RSTCTL_RESPRST_Msk          (1UL << I3C_RSTCTL_RESPRST_Pos)

#define I3C_RSTCTL_TXRST_Pos            (3U)
#define I3C_RSTCTL_TXRST_Msk            (1UL << I3C_RSTCTL_TXRST_Pos)

#define I3C_RSTCTL_RXRST_Pos            (4U)
#define I3C_RSTCTL_RXRST_Msk            (1UL << I3C_RSTCTL_RXRST_Pos)

#define I3C_RSTCTL_IBIQRST_Pos          (5U)
#define I3C_RSTCTL_IBIQRXRST_Msk        (1UL << I3C_RSTCTL_IBIQRST_Pos)

#define I3C_SLVEVNTS_SIREN_Pos          (0U)
#define I3C_SLVEVNTS_SIREN_Msk          (1UL << I3C_SLVEVNTS_SIREN_Pos)

#define I3C_SLVEVNTS_MREN_Pos           (1U)
#define I3C_SLVEVNTS_MREN_Msk           (1UL << I3C_SLVEVNTS_MREN_Pos)

#define I3C_SLVEVNTS_HJEN_Pos           (3U)
#define I3C_SLVEVNTS_HJEN_Msk           (1UL << I3C_SLVEVNTS_HJEN_Pos)

#define I3C_SLVEVNTS_ACTSTATE_Pos       (4U)
#define I3C_SLVEVNTS_ACTSTATE_Msk       (3UL << I3C_SLVEVNTS_ACTSTATE_Pos)

#define I3C_SLVEVNTS_MRLUPD_Pos         (6U)
#define I3C_SLVEVNTS_MRLUPD_Msk         (1UL << I3C_SLVEVNTS_MRLUPD_Pos)

