zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/i3c_reg.h
#define I3C_SLVEVNTS_MWLUPD_Pos         (7U)
#define I3C_SLVEVNTS_MWLUPD_Msk         (1UL << I3C_SLVEVNTS_MWLUPD_Pos)

#define I3C_INTSTS_TXTH_Pos             (0U)
#define I3C_INTSTS_TXTH_Msk             (1UL << I3C_INTSTS_TXTH_Pos)

#define I3C_INTSTS_RXTH_Pos             (1U)
#define I3C_INTSTS_RXTH_Msk             (1UL << I3C_INTSTS_RXTH_Pos)

#define I3C_INTSTS_IBITH_Pos            (2U)
#define I3C_INTSTS_IBITH_Msk            (1UL << I3C_INTSTS_IBITH_Pos)

#define I3C_INTSTS_CMDRDY_Pos           (3U)
#define I3C_INTSTS_CMDRDY_Msk           (1UL << I3C_INTSTS_CMDRDY_Pos)

#define I3C_INTSTS_RESPRDY_Pos          (4U)
#define I3C_INTSTS_RESPRDY_Msk          (1UL << I3C_INTSTS_RESPRDY_Pos)

#define I3C_INTSTS_TFRABORT_Pos         (5U)
#define I3C_INTSTS_TFRABORT_Msk         (1UL << I3C_INTSTS_TFRABORT_Pos)

#define I3C_INTSTS_CCCUPD_Pos           (6U)
#define I3C_INTSTS_CCCUPD_Msk           (1UL << I3C_INTSTS_CCCUPD_Pos)

#define I3C_INTSTS_DAA_Pos              (8U)
#define I3C_INTSTS_DAA_Msk              (1UL << I3C_INTSTS_DAA_Pos)

#define I3C_INTSTS_TFRERR_Pos           (9U)
#define I3C_INTSTS_TFRERR_Msk           (1UL << I3C_INTSTS_TFRERR_Pos)

#define I3C_INTSTS_DEFSLV_Pos           (10U)
#define I3C_INTSTS_DEFSLV_Msk           (1UL << I3C_INTSTS_DEFSLV_Pos)

#define I3C_INTSTS_READREQ_Pos          (11U)
#define I3C_INTSTS_READREQ_Msk          (1UL << I3C_INTSTS_READREQ_Pos)

#define I3C_INTSTS_IBIUPD_Pos           (12U)
#define I3C_INTSTS_IBIUPD_Msk           (1UL << I3C_INTSTS_IBIUPD_Pos)

#define I3C_INTSTS_BUSOWNER_Pos         (13U)
#define I3C_INTSTS_BUSOWNER_Msk         (1UL << I3C_INTSTS_BUSOWNER_Pos)

#define I3C_INTSTS_BUSRSTDN_Pos         (15U)
#define I3C_INTSTS_BUSRSTDN_Msk         (1UL << I3C_INTSTS_BUSRSTDN_Pos)

#define I3C_INTSTSEN_TXTH_Pos           (0U)
#define I3C_INTSTSEN_TXTH_Msk           (1UL << I3C_INTSTSEN_TXTH_Pos)

#define I3C_INTSTSEN_RXTH_Pos           (1U)
#define I3C_INTSTSEN_RXTH_Msk           (1UL << I3C_INTSTSEN_RXTH_Pos)

#define I3C_INTSTSEN_IBITH_Pos          (2U)
#define I3C_INTSTSEN_IBITH_Msk          (1UL << I3C_INTSTSEN_IBITH_Pos)

#define I3C_INTSTSEN_CMDRDY_Pos         (3U)
#define I3C_INTSTSEN_CMDRDY_Msk         (1UL << I3C_INTSTSEN_CMDRDY_Pos)

#define I3C_INTSTSEN_RESPRDY_Pos        (4U)
#define I3C_INTSTSEN_RESPRDY_Msk        (1UL << I3C_INTSTSEN_RESPRDY_Pos)

#define I3C_INTSTSEN_TFRABORT_Pos       (5U)
#define I3C_INTSTSEN_TFRABORT_Msk       (1UL << I3C_INTSTSEN_TFRABORT_Pos)

#define I3C_INTSTSEN_CCCUPD_Pos         (6U)
#define I3C_INTSTSEN_CCCUPD_Msk         (1UL << I3C_INTSTSEN_CCCUPD_Pos)

#define I3C_INTSTSEN_DAA_Pos            (8U)
#define I3C_INTSTSEN_DAA_Msk            (1UL << I3C_INTSTSEN_DAA_Pos)

#define I3C_INTSTSEN_TFRERR_Pos         (9U)
#define I3C_INTSTSEN_TFRERR_Msk         (1UL << I3C_INTSTSEN_TFRERR_Pos)

#define I3C_INTSTSEN_DEFSLV_Pos         (10U)
#define I3C_INTSTSEN_DEFSLV_Msk         (1UL << I3C_INTSTSEN_DEFSLV_Pos)

#define I3C_INTSTSEN_READREQ_Pos        (11U)
#define I3C_INTSTSEN_READREQ_Msk        (1UL << I3C_INTSTSEN_READREQ_Pos)

#define I3C_INTSTSEN_IBIUPD_Pos         (12U)
#define I3C_INTSTSEN_IBIUPD_Msk         (1UL << I3C_INTSTSEN_IBIUPD_Pos)

#define I3C_INTSTSEN_BUSOWNER_Pos       (13U)
#define I3C_INTSTSEN_BUSOWNER_Msk       (1UL << I3C_INTSTSEN_BUSOWNER_Pos)

#define I3C_INTSTSEN_BUSRSTDN_Pos       (15U)
#define I3C_INTSTSEN_BUSRSTDN_Msk       (1UL << I3C_INTSTSEN_BUSRSTDN_Pos)

#define I3C_INTEN_TXTH_Pos              (0U)
#define I3C_INTEN_TXTH_Msk              (1UL << I3C_INTEN_TXTH_Pos)

#define I3C_INTEN_RXTH_Pos              (1U)
#define I3C_INTEN_RXTH_Msk              (1UL << I3C_INTEN_RXTH_Pos)

#define I3C_INTEN_IBITH_Pos             (2U)
#define I3C_INTEN_IBITH_Msk             (1UL << I3C_INTEN_IBITH_Pos)

#define I3C_INTEN_CMDRDY_Pos            (3U)
#define I3C_INTEN_CMDRDY_Msk            (1UL << I3C_INTEN_CMDRDY_Pos)

#define I3C_INTEN_RESPRDY_Pos           (4U)
#define I3C_INTEN_RESPRDY_Msk           (1UL << I3C_INTEN_RESPRDY_Pos)

#define I3C_INTEN_TFRABORT_Pos          (5U)
#define I3C_INTEN_TFRABORT_Msk          (1UL << I3C_INTEN_TFRABORT_Pos)

#define I3C_INTEN_CCCUPD_Pos            (6U)
#define I3C_INTEN_CCCUPD_Msk            (1UL << I3C_INTEN_CCCUPD_Pos)

#define I3C_INTEN_DAA_Pos               (8U)
#define I3C_INTEN_DAA_Msk               (1UL << I3C_INTEN_DAA_Pos)

#define I3C_INTEN_TFRERR_Pos            (9U)
#define I3C_INTEN_TFRERR_Msk            (1UL << I3C_INTEN_TFRERR_Pos)

#define I3C_INTEN_DEFSLV_Pos            (10U)
#define I3C_INTEN_DEFSLV_Msk            (1UL << I3C_INTEN_DEFSLV_Pos)

#define I3C_INTEN_READREQ_Pos           (11U)
#define I3C_INTEN_READREQ_Msk           (1UL << I3C_INTEN_READREQ_Pos)

#define I3C_INTEN_IBIUPD_Pos            (12U)
#define I3C_INTEN_IBIUPD_Msk            (1UL << I3C_INTEN_IBIUPD_Pos)

#define I3C_INTEN_BUSOWNER_Pos          (13U)
#define I3C_INTEN_BUSOWNER_Msk          (1UL << I3C_INTEN_BUSOWNER_Pos)

#define I3C_INTEN_BUSRSTDN_Pos          (15U)
#define I3C_INTEN_BUSRSTDN_Msk          (1UL << I3C_INTEN_BUSRSTDN_Pos)

#define I3C_QUESTSLV_CMDELOC_Pos        (0U)
#define I3C_QUESTSLV_CMDELOC_Msk        (0xFFUL << I3C_QUESTSLV_CMDELOC_Pos)

#define I3C_QUESTSLV_RESPLV_Pos         (8U)
#define I3C_QUESTSLV_RESPLV_Msk         (0xFFUL << I3C_QUESTSLV_RESPLV_Pos)

#define I3C_QUESTSLV_IBIBLR_Pos         (16U)
#define I3C_QUESTSLV_IBIBLR_Msk         (0xFFUL << I3C_QUESTSLV_IBIBLR_Pos)

#define I3C_QUESTSLV_IBISCNT_Pos        (24U)
#define I3C_QUESTSLV_IBISCNT_Msk        (0x1FUL << I3C_QUESTSLV_IBISCNT_Pos)

#define I3C_DBSTSLV_TXELV_Pos           (0U)
#define I3C_DBSTSLV_TXELV_Msk           (0xFFUL << I3C_DBSTSLV_TXELV_Pos)

#define I3C_DBSTSLV_RXLV_Pos            (16U)
#define I3C_DBSTSLV_RXLV_Msk            (0xFFUL << I3C_DBSTSLV_RXLV_Pos)

#define I3C_PRESENTS_SCLLEL_Pos         (0U)
#define I3C_PRESENTS_SCLLEL_Msk         (1UL << I3C_PRESENTS_SCLLEL_Pos)

#define I3C_PRESENTS_SDALEL_Pos         (1U)
#define I3C_PRESENTS_SDALEL_Msk         (1UL << I3C_PRESENTS_SDALEL_Pos)

#define I3C_PRESENTS_TFRTYPE_Pos        (8U)
#define I3C_PRESENTS_TFRTYPE_Msk        (0x3FUL << I3C_PRESENTS_TFRTYPE_Pos)

#define I3C_PRESENTS_CMTFRSTS_Pos       (16U)
#define I3C_PRESENTS_CMTFRSTS_Msk       (0x3FUL << I3C_PRESENTS_CMTFRSTS_Pos)

