zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/i3c_reg.h
#define I3C_PRESENTS_TID_Pos            (24U)
#define I3C_PRESENTS_TID_Msk            (0xFUL << I3C_PRESENTS_TID_Pos)

#define I3C_PRESENTS_MAIDLE_Pos         (28U)
#define I3C_PRESENTS_MAIDLE_Msk         (1UL << I3C_PRESENTS_MAIDLE_Pos)

#define I3C_CCCDEVS_PENDINT_Pos         (0U)
#define I3C_CCCDEVS_PENDINT_Msk         (0xFUL << I3C_CCCDEVS_PENDINT_Pos)

#define I3C_CCCDEVS_PROTERR_Pos         (5U)
#define I3C_CCCDEVS_PROTERR_Msk         (1UL << I3C_CCCDEVS_PROTERR_Pos)

#define I3C_CCCDEVS_ACTMODE_Pos         (6U)
#define I3C_CCCDEVS_ACTMODE_Msk         (3UL << I3C_CCCDEVS_ACTMODE_Pos)

#define I3C_CCCDEVS_UDFERR_Pos          (8U)
#define I3C_CCCDEVS_UDFERR_Msk          (1UL << I3C_CCCDEVS_UDFERR_Pos)

#define I3C_CCCDEVS_SLVBUSY_Pos         (9U)
#define I3C_CCCDEVS_SLVBUSY_Msk         (1UL << I3C_CCCDEVS_SLVBUSY_Pos)

#define I3C_CCCDEVS_OVFERR_Pos          (10U)
#define I3C_CCCDEVS_OVFERR_Msk          (1UL << I3C_CCCDEVS_OVFERR_Pos)

#define I3C_CCCDEVS_DATNRDY_Pos         (11U)
#define I3C_CCCDEVS_DATNRDY_Msk         (1UL << I3C_CCCDEVS_DATNRDY_Pos)

#define I3C_CCCDEVS_BFNAVAIL_Pos        (12U)
#define I3C_CCCDEVS_BFNAVAIL_Msk        (1UL << I3C_CCCDEVS_BFNAVAIL_Pos)

#define I3C_CCCDEVS_FRAMEERR_Pos        (13U)
#define I3C_CCCDEVS_FRAMEERR_Msk        (1UL << I3C_CCCDEVS_FRAMEERR_Pos)

#define I3C_ADDRTP_STARTADDR_Pos        (0U)
#define I3C_ADDRTP_STARTADDR_Msk        (0xFFFFUL << I3C_ADDRTP_STARTADDR_Pos)

#define I3C_ADDRTP_TABLEDEPTH_Pos       (16U)
#define I3C_ADDRTP_TABLEDEPTH_Msk       (0xFFFFUL << I3C_ADDRTP_TABLEDEPTH_Pos)

#define I3C_CHRTP_CHARSTART_Pos         (0U)
#define I3C_CHRTP_CHARSTART_Msk         (0xFFFUL << I3C_CHRTP_CHARSTART_Pos)

#define I3C_CHRTP_CHARDEPTH_Pos         (12U)
#define I3C_CHRTP_CHARDEPTH_Msk         (0x7FUL << I3C_CHRTP_CHARDEPTH_Pos)

#define I3C_CHRTP_CHARINDEX_Pos         (19U)
#define I3C_CHRTP_CHARINDEX_Msk         (0x1FFFUL << I3C_CHRTP_CHARINDEX_Pos)

#define I3C_VENDOR_VENODRADDR_Pos       (0U)
#define I3C_VENDOR_VENODRADDR_Msk       (0xFFFFUL << I3C_VENDOR_VENODRADDR_Pos)

#define I3C_SLVMID_PIDTYPE_Pos          (0U)
#define I3C_SLVMID_PIDTYPE_Msk          (1UL << I3C_SLVMID_PIDTYPE_Pos)

#define I3C_SLVMID_MID_Pos              (1U)
#define I3C_SLVMID_MID_Msk              (0x7FFFUL << I3C_SLVMID_MID_Pos)

#define I3C_SLVPID_DCR_Pos              (0U)
#define I3C_SLVPID_DCR_Msk              (0xFFFUL << I3C_SLVPID_DCR_Pos)

#define I3C_SVLPID_INSTID_Pos           (12U)
#define I3C_SVLPID_INSTID_Msk           (0xFUL << I3C_SVLPID_INSTID_Pos)

#define I3C_SLVPID_PARTID_Pos           (16U)
#define I3C_SLVPID_PARTID_Msk           (0xFFFFUL << I3C_SLVPID_PARTID_Pos)

#define I3C_SLVCHAR_MAXDSLIM_Pos        (0U)
#define I3C_SLVCHAR_MAXDSLIM_Msk        (1UL << I3C_SLVCHAR_MAXDSLIM_Pos)

#define I3C_SLVCHAR_IBICAP_Pos          (1U)
#define I3C_SLVCHAR_IBICAP_Msk          (1UL << I3C_SLVCHAR_IBICAP_Pos)

#define I3C_SLVCHAR_IBIPL_Pos           (2U)
#define I3C_SLVCHAR_IBIPL_Msk           (1UL << I3C_SLVCHAR_IBIPL_Pos)

#define I3C_SLVCHAR_OLCAP_Pos           (3U)
#define I3C_SLVCHAR_OLCAP_Msk           (1UL << I3C_SLVCHAR_OLCAP_Pos)

#define I3C_SLVCHAR_BRIDGEID_Pos        (4U)
#define I3C_SLVCHAR_BRIDGEID_Msk        (1UL << I3C_SLVCHAR_BRIDGEID_Pos)

#define I3C_SLVCHAR_HDRCAP_Pos          (5U)
#define I3C_SLVCHAR_HDRCAP_Msk          (1UL << I3C_SLVCHAR_HDRCAP_Pos)

#define I3C_SLVCHAR_DEVROLE_Pos         (6U)
#define I3C_SLVCHAR_DEVROLE_Msk         (0x3UL << I3C_SLVCHAR_DEVROLE_Pos)

#define I3C_SLVCHAR_DCR_Pos             (8U)
#define I3C_SLVCHAR_DCR_Msk             (0xFFUL << I3C_SLVCHAR_DCR_Pos)

#define I3C_SLVCHAR_HDRCPVAL_Pos        (16U)
#define I3C_SLVCHAR_HDRCPVAL_Msk        (0xFFUL << I3C_SLVCHAR_HDRCPVAL_Pos)

#define I3C_SLVMXLEN_MWL_Pos            (0U)
#define I3C_SLVMXLEN_MWL_Msk            (0xFFFFUL << I3C_SLVMXLEN_MWL_Pos)

#define I3C_SLVMXLEN_MRL_Pos            (16U)
#define I3C_SLVMXLEN_MRL_Msk            (0xFFFFUL << I3C_SLVMXLEN_MRL_Pos)

#define I3C_MXRDTURN_MXRDTURN_Pos       (0U)
#define I3C_MXRDTURN_MXRDTURN_Msk       (0xFFFFFFUL << I3C_MXRDTURN_MXRDTURN_Pos)

#define I3C_MXDS_MXWR_Pos               (0U)
#define I3C_MXDS_MXWR_Msk               (0x7UL << I3C_MXDS_MXWR_Pos)

#define I3C_MXDS_MXRD_Pos               (8U)
#define I3C_MXDS_MXRD_Msk               (0x7UL << I3C_MXDS_MXRD_Pos)

#define I3C_MXDS_MXDTURN_Pos            (16U)
#define I3C_MXDS_MXDTURN_Msk            (0x7UL << I3C_MXDS_MXDTURN_Pos)

#define I3C_SIR_EN_Pos                  (0U)
#define I3C_SIR_EN_Msk                  (1UL << I3C_SIR_EN_Pos)

#define I3C_SIR_CTL_Pos                 (1U)
#define I3C_SIR_CTL_Msk                 (0x3UL << I3C_SIR_CTL_Pos)

#define I3C_SIR_MR_Pos                  (3U)
#define I3C_SIR_MR_Msk                  (0x1UL << I3C_SIR_MR_Pos)

#define I3C_SIR_MDB_Pos                 (8U)
#define I3C_SIR_MDB_Msk                 (0xFFUL << I3C_SIR_MDB_Pos)

#define I3C_SIR_DATLEN_Pos              (16U)
#define I3C_SIR_DATLEN_Msk              (0xFFUL << I3C_SIR_DATLEN_Pos)

#define I3C_SIRDAT_DAT0_Pos             (0U)
#define I3C_SIRDAT_DAT0_Msk             (0xFFUL << I3C_SIRDAT_DAT0_Pos)

#define I3C_SIRDAT_DAT1_Pos             (8U)
#define I3C_SIRDAT_DAT1_Msk             (0xFFUL << I3C_SIRDAT_DAT1_Pos)

#define I3C_SIRDAT_DAT2_Pos             (16U)
#define I3C_SIRDAT_DAT2_Msk             (0xFFUL << I3C_SIRDAT_DAT2_Pos)

#define I3C_SIRDAT_DAT3_Pos             (24U)
#define I3C_SIRDAT_DAT3_Msk             (0xFFUL << I3C_SIRDAT_DAT3_Pos)

#define I3C_SIRRESP_IBISTS_Pos          (0U)
#define I3C_SIRRESP_IBISTS_Msk          (0x7UL << I3C_SIRRESP_IBISTS_Pos)

#define I3C_SIRRESP_DATLEN_Pos          (8U)
#define I3C_SIRRESP_DATLEN_Msk          (0xFFFFUL << I3C_SIRRESP_DATLEN_Pos)

#define I3C_DEVCTLE_OPERMODE_Pos        (0U)
#define I3C_DEVCTLE_OPERMODE_Msk        (0x3UL << I3C_DEVCTLE_OPERMODE_Pos)

#define I3C_SCLOD_ODLCNT_Pos            (0U)
#define I3C_SCLOD_ODLCNT_Msk            (0xFFUL << I3C_SCLOD_ODLCNT_Pos)

#define I3C_SCLOD_ODHCNT_Pos            (16U)
#define I3C_SCLOD_ODHCNT_Msk            (0xFFUL << I3C_SCLOD_ODHCNT_Pos)

