zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/i3c_reg.h
#define I3C_SCLPP_PPLCNT_Pos            (0U)
#define I3C_SCLPP_PPLCNT_Msk            (0xFFUL << I3C_SCLPP_PPLCNT_Pos)

#define I3C_SCLPP_PPHCNT_Pos            (16U)
#define I3C_SCLPP_PPHCNT_Msk            (0xFFUL << I3C_SCLPP_PPHCNT_Pos)

#define I3C_SCLFM_FMLCNT_Pos            (0U)
#define I3C_SCLFM_FMLCNT_Msk            (0xFFFFUL << I3C_SCLFM_FMLCNT_Pos)

#define I3C_SCLFM_FMHCNT_Pos            (16U)
#define I3C_SCLFM_FMHCNT_Msk            (0xFFFFUL << I3C_SCLFM_FMHCNT_Pos)

#define I3C_SCLFMP_FMPLCNT_Pos          (0U)
#define I3C_SCLFMP_FMPLCNT_Msk          (0xFFFFUL << I3C_SCLFMP_FMPLCNT_Pos)

#define I3C_SCLFMP_FMPHCNT_Pos          (16U)
#define I3C_SCLFMP_FMPHCNT_Msk          (0xFFUL << I3C_SCLFMP_FMPHCNT_Pos)

#define I3C_SCLEXTL_EXLCNT1_Pos         (0U)
#define I3C_SCLEXTL_EXLCNT1_Msk         (0xFFUL << I3C_SCLEXTL_EXLCNT1_Pos)

#define I3C_SCLEXTL_EXLCNT2_Pos         (8U)
#define I3C_SCLEXTL_EXLCNT2_Msk         (0xFFUL << I3C_SCLEXTL_EXLCNT2_Pos)

#define I3C_SCLEXTL_EXLCNT3_Pos         (16U)
#define I3C_SCLEXTL_EXLCNT3_Msk         (0xFFUL << I3C_SCLEXTL_EXLCNT3_Pos)

#define I3C_SCLEXTL_EXLCNT4_Pos         (24U)
#define I3C_SCLEXTL_EXLCNT4_Msk         (0xFFUL << I3C_SCLEXTL_EXLCNT4_Pos)

#define I3C_SCLTERM_EXTERM_Pos          (0U)
#define I3C_SCLTERM_EXTERM_Msk          (0xFUL << I3C_SCLTERM_EXTERM_Pos)

#define I3C_SCLTERM_STOPHLD_Pos         (28U)
#define I3C_SCLTERM_STOPHLD_Msk         (0xFUL << I3C_SCLTERM_STOPHLD_Pos)

#define I3C_SDAHOLD_TXHOLD_Pos          (16U)
#define I3C_SDAHOLD_TXHOLD_Msk          (0x7UL << I3C_SDAHOLD_TXHOLD_Pos)

#define I3C_BUSFAT_AVAILTC_Pos          (16U)
#define I3C_BUSFAT_AVAILTC_Msk          (0xFFFFUL << I3C_BUSFAT_AVAILTC_Pos)

#define I3C_BUSIDLET_IDLETC_Pos         (0U)
#define I3C_BUSIDLET_IDLETC_Msk         (0xFFFFFUL << I3C_BUSIDLET_IDLETC_Pos)

#define I3C_SCLLOW_LOWTIMER_Pos         (0U)
#define I3C_SCLLOW_LOWTIMER_Msk         (0xFFFFFFFFUL << I3C_SCLLOW_LOWTIMER_Pos)

#define I3C_DEVADR_SADDR_Pos            (0U)
#define I3C_DEVADR_SADDR_Msk            (0x7FUL << I3C_DEVADR_SADDR_Pos)

#define I3C_DEVADR_IBIPECEN_Pos         (11U)
#define I3C_DEVADR_IBIPECEN_Msk         (0x1UL << I3C_DEVADR_IBIPECEN_Pos)

#define I3C_DEVADR_IBIWDAT_Pos          (12U)
#define I3C_DEVADR_IBIWDAT_Msk          (0x1UL << I3C_DEVADR_IBIWDAT_Pos)

#define I3C_DEVADR_SIRREJECT_Pos        (13U)
#define I3C_DEVADR_SIRREJECT_Msk        (0x1UL << I3C_DEVADR_SIRREJECT_Pos)

#define I3C_DEVADR_MRREJECT_Pos         (14U)
#define I3C_DEVADR_MRREJECT_Msk         (0x1UL << I3C_DEVADR_MRREJECT_Pos)

#define I3C_DEVADR_DADDR_Pos            (16U)
#define I3C_DEVADR_DADDR_Msk            (0xFFUL << I3C_DEVADR_DADDR_Pos)

#define I3C_DEVADR_NAKRCNT_Pos          (29U)
#define I3C_DEVADR_NAKRCNT_Msk          (0x3UL << I3C_DEVADR_NAKRCNT_Pos)

#define I3C_DEVADR_DEVICE_Pos           (31U)
#define I3C_DEVADR_DEVICE_Msk           (0x1UL << I3C_DEVADR_DEVICE_Pos)

/** @} I3C_CONST */
/** @} end of I3C register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __I3C_REG_H__ */
